import numpy as np
from PIL import Image


class BMPColor:
    b=0
    g=0
    r=0
    a=255

    def __init__(self, r=0, g=0,b=0,a=255):
        self.b=b
        self.g=g
        self.r=r
        self.a=a

    #为了提高覆盖率
    # def setSelf(self,data):
    #     self.b=data.b
    #     self.g=data.g
    #     self.r=data.r
    #     self.a=data.a
    #     return self


def saveBitmap(w,h,arrBitMap,fileName):
    #将元素类型更改为'uint8'
    arrBitMap_color=[]
    for i in range(len(arrBitMap)):
        arrBitMap_color.append(arrBitMap[i].b)
        arrBitMap_color.append(arrBitMap[i].g)
        arrBitMap_color.append(arrBitMap[i].r)
        arrBitMap_color.append(arrBitMap[i].a)
    arrBitMap_color=np.array(arrBitMap_color)

    arrBitMap_color=np.reshape(arrBitMap_color,(h,w,4))
    #第一个参数为存储的地址和名称，第二个参数为存储的图片类型
    image=Image.fromarray(arrBitMap_color.astype(np.uint8))
    image.save(fileName,"bmp")
    


# if __name__=="__main__":
    #读入数据arr，此处为手动设置
    #arr__ = np.array([[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66],[0,0,0,0,0,44,4,44,67,88,99,50,66]])
    